/* 学号 姓名 班级 */
#include <iostream>
#include <cmath>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

/***************************************************************************
  函数名称：
  功    能：返回n阶legendre多项式的值
  输入参数：
  返 回 值：
  说    明：函数名、形参、返回类型均不准动
***************************************************************************/
double legendre(double x, int n)
{
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：完成输入、调用递归函数、输出
***************************************************************************/
int main()
{
}

