/* 1851521 软工 沈天宇 */
#include<iostream>

#define 错位时空 int main(){;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#define 出品 return 0;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#define X工作室 };;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#define 制作人沈天宇 int a=1, b=2, c=3, d=4, e=5, l=6, m=5;;;

#define 我吹过你吹过的晚风 int f=6, g=7, h=8, i=9, j=8, k=7;;
#define 那我们算不算 int n=4, o=3, p=2, q=1, r=2, s=3;;;;;;;;
#define 相拥 int t=4, u=5, v=6, w=7, x=8, y=9, z=8;;;;;;;;;;;
#define 可如梦初醒般的两手空空 (a+b*(c+d*(e+f*(g+h))));;;;;;;
#define 心也空 {}{{{{{{{{{{{{{{{{{{{{{{}}}}}}}}}}}}}}}}}}}}}}

#define 我吹过你吹过的 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#define 晚风 {}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
#define 是否看过同样 {{{{}}}}{{{{}}}}{{{{}}}}{{{{}}}}{{{{}}}}
#define 风景 {{{{}}}}{{{{}}}}{{{{}}}}{{{{}}}}{{{{}}}}{{{{}}}}
#define 像扰乱时差留在错位时空 z=a+b-c*d+e;;;;;;;;;;;;;;;;;{}
#define 终是空  y=f---(g--+g+++h*i+j/k-l)*m-(n);{{{{{{{{{{{{{
#define 是空 }}}}}}}}}}}};;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;}


错位时空
制作人沈天宇

	我吹过你吹过的晚风
	那我们算不算 相拥
	可如梦初醒般的两手空空
	心也空

	我吹过你吹过的 晚风
	是否看过同样 风景
	像扰乱时差留在错位时空
	终是空 是空

出品 X工作室